# PrimaryHandrailLateralOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RailingType..::..PrimaryHandrailLateralOffset Property
RailingType Class See Also
---
The lateral offset of the primary handrail.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double PrimaryHandrailLateralOffset { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PrimaryHandrailLateralOffset As Double
	Get
```

Visual C++
---
```text
public:
property double PrimaryHandrailLateralOffset {
	double get ();
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The rail has no primary hand rail. |

# See Also
RailingType Class
Autodesk.Revit.DB.Architecture Namespace